---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsSubElementsNotConnectedWarning
source: html/9c0793c7-1897-7b44-8b3b-7386dae366c4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsSubElementsNotConnectedWarning Property

Stair sub-elements are not connected

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsSubElementsNotConnectedWarning { get; }
```